:PROPERTIES:
:CATEGORY: thunderbird-native-messaging-server
:END:
* note
#+begin_src js

// The user clicked our button, get the active tab in the current window using
// the tabs API.
let tabs = await messenger.tabs.query({ active: true, currentWindow: true });

// Get the message currently displayed in the active tab, using the
// messageDisplay API. Note: This needs the messagesRead permission.
// The returned message is a MessageHeader object with the most relevant
// information.
let message = await messenger.messageDisplay.getDisplayedMessage(tabs[0].id);

// Update the HTML fields with the message subject and sender.
document.getElementById("subject").textContent = message.subject;
document.getElementById("from").textContent = message.author;

// Request the full message to access its full set of headers.
let full = await messenger.messages.getFull(message.id);
// document.getElementById("received").textContent = full.headers.received[0];
document.getElementById("received").textContent = JSON.stringify(message);

// message = 
// {
//    "author" : "Indigo <email@indigo.ca>",
//    "bccList" : [],
//    "ccList" : [],
//    "date" : "2025-05-18T13:46:58.000Z",
//    "external" : false,
//    "flagged" : false,
//    "folder" : {
//       "accountId" : "account6",
//       "id" : "account6://INBOX",
//       "isFavorite" : true,
//       "isRoot" : false,
//       "isTag" : false,
//       "isUnified" : false,
//       "isVirtual" : false,
//       "name" : "Inbox",
//       "path" : "/INBOX",
//       "specialUse" : [
//          "inbox"
//       ],
//       "type" : "inbox"
//    },
//    "headerMessageId" : "20250518094658.39900888.1642936@sailthru.com",
//    "headersOnly" : false,
//    "id" : 42,
//    "junk" : false,
//    "junkScore" : 0,
//    "new" : false,
//    "read" : true,
//    "recipients" : [
//       "thanhvg@gmail.com"
//    ],
//    "size" : 61401,
//    "subject" : "Your Birth Year in Books — See What Was Trending",
//    "tags" : []
// }

// get message by mid
// mark message read
//             messenger.messages.update(messageHeader.id, {
// read: false,
//             });

#+end_src

* arc

td <-> srv <-> client

client 

#+begin_src plantuml :results verbatim
@startuml
participant "client" as client 
participant "server" as srv 
participant "thunderbird" as tb 

client -> srv: GET mid/123
srv -> tb: stdout:\n { type: mid, payload: 123 }
@enduml

#+end_src

#+RESULTS:
#+begin_example
     ,------.           ,------.                    ,-----------.
     |client|           |server|                    |thunderbird|
     `---+--'           `---+--'                    `-----+-----'
         |   GET mid/123    |                             |      
         |----------------->|                             |      
         |                  |                             |      
         |                  |stdout:                      |      
         |                  | { type: mid, payload: 123 } |      
         |                  |---------------------------->|      
     ,---+--.           ,---+--.                    ,-----+-----.
     |client|           |server|                    |thunderbird|
     `------'           `------'                    `-----------'
#+end_example
* problems
- native app manifest must be declared with full path ~/ work work
- thunderbird won't close native app propperly
- python load path is crap must use bash
* update
messagesUpdate
https://webextension-api.thunderbird.net/en/beta-mv2/messages.html#permissions
* emacs
#+begin_src elisp
(defun mu4e/thunderbird-mark-as-read (msg)
  "To set as `mu4e-view-auto-mark-as-read'"
  (message (format "http://localhost:1337/mid/%s" (mu4e-message-field msg :message-id)))
  (url-retrieve
   (format "http://localhost:1337/mid/%s" (mu4e-message-field msg :message-id))
   (lambda (_status) (kill-buffer (current-buffer)))
   nil
   nil)
  t)


(setq mu4e-view-auto-mark-as-read #'mu4e/thunderbird-mark-as-read)
#+end_src

#+RESULTS:
: mu4e/thunderbird-mark-as-read
* TODO query about messages read status

#+begin_src plantuml :results verbatim
@startuml
participant "client" as client 
participant "server" as srv 
participant "thunderbird" as tb 

client -> srv: POST /status \n { mids: [123, 345] }
srv -> tb: stdout:\n { type: 'readStatus', payload: [123, 456] }
tb -> srv: stdin:\n { type: 'readStatus', payload: {123: true, 456a: false} }
srv -> client: {123: true, 456: false}
@enduml

#+end_src

#+RESULTS:
#+begin_example
     ,------.                 ,------.                                                  ,-----------.
     |client|                 |server|                                                  |thunderbird|
     `---+--'                 `---+--'                                                  `-----+-----'
         | POST /status           |                                                           |      
         |  { mids: [123, 345] }  |                                                           |      
         |----------------------->|                                                           |      
         |                        |                                                           |      
         |                        |       stdout:                                             |      
         |                        |        { type: 'readStatus', payload: [123, 456] }        |      
         |                        |---------------------------------------------------------->|      
         |                        |                                                           |      
         |                        |stdin:                                                     |      
         |                        | { type: 'readStatus', payload: {123: true, 456a: false} } |      
         |                        |<----------------------------------------------------------|      
         |                        |                                                           |      
         |{123: true, 456: false} |                                                           |      
         |<-----------------------|                                                           |      
     ,---+--.                 ,---+--.                                                  ,-----+-----.
     |client|                 |server|                                                  |thunderbird|
     `------'                 `------'                                                  `-----------'
#+end_example
